/*******************************************************************************
 * 工程名称:VNet新一代工程固件
 * 模块名称:port_operate
 * 文件名称:port.h
 * 实现功能:CPU串口操作声明头文件
 * 备注:
------------------------------------原始版本--------------------------------------
* 日期:2013/3/30
* 版本:V1.0
* 作者:韩伟浩
* 功能:
* 说明:对CPU串口操作配置的一些函数进行声明
------------------------------------更新版本--------------------------------------
------
*******************************************************************************/

/**********************************包含头文件************************************/
#include <stdio.h>
#include <string.h>
#include <strings.h>
#include <termios.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/types.h>


/*********************************函数声明**************************************/

int Open_Port(int fd, char *port_dev);                            //打开串口
int Set_Port(int fd, int nSpeed, int nBits, char nEvent, int nStop);  //设置串口
int Open_Port_R(int fd, char *port_dev);
int Open_Port_W(int fd, char *port_dev);
/**********************************文件结束**************************************/
